import { useState } from "react";
import { Link } from "react-router";
import { HashLink } from "react-router-hash-link";
import { Logo } from "../../public/assets";
import { FaBars } from "react-icons/fa";
import { IoCloseSharp } from "react-icons/io5";
import "../Components/Navbarbtn.css";

const Navbar = () => {
    // State Of Menu Bar
    const [bar, setBar] = useState(false);
    // Data Links
    const links = [
        {id: 0 , name: "الصفحة الرئيسية" , to: "/#panal"},
        {id: 1 , name: "عروضنا" , to: "/#offers"},
        {id: 2 , name: "معالم مشهورة" , to: "/#landmark"},
        {id: 3 , name: "حول" , to: "/#about"},
        {id: 4 , name: "الأسئلة الشائعة" , to: "/#questions"},
    ];
    return (
        <nav dir="rtl" className="px-[5%]! py-1! fixed w-full bg-white border-b-1 border-gray-200 z-50">
            <div className="container mx-auto! flex items-center justify-between">
                <div className="flex items-center gap-3">
                    <Link to={"/"}>
                        <img src={Logo} alt="Image-Error" loading="lazy" />
                    </Link>
                    <Link to={"/"}>
                        <h3 className="text-2xl font-bold hover:text-[#2986FE] transition duration-400">Freelance <span className="text-[#2986FE] hover:text-black transition duration-400">TL</span></h3>
                    </Link>
                </div>
                <div className="hidden lg:flex gap-3">
                    {links.map(link => (
                        <HashLink smooth className="text-white bg-[#2986FE] hover:bg-white hover:text-[#2986FE] border-2 p-2! rounded transition duration-400" key={link.id} to={link.to}>{link.name}</HashLink>
                    ))}
                </div>
                <div className="hidden lg:flex">
                    <Link to="signin">
                        <button className="CartBtn bg-[#2986FE]">
                            <span className="IconContainer">
                                <svg viewBox="0 0 13 13" width="18px">
                                    <path
                                        fill="white"
                                        d="M1.55989957,5.41666667 L5.51582215,5.41666667 L4.47015462,0.108333333 L4.47015462,0.108333333 C4.47015462,0.0634601974 4.49708054,0.0249592654 4.5354546,0.00851337035 L4.57707145,0 L5.36229752,0 C5.43359776,0 5.50087375,0.028779451 5.55026392,0.0782711996 L5.59317877,0.134368264 L7.13659662,2.81558333 L8.29565964,2.81666667 C8.53185377,2.81666667 8.72332694,3.01067661 8.72332694,3.25 C8.72332694,3.48932339 8.53185377,3.68333333 8.29565964,3.68333333 L7.63589819,3.68225 L8.63450135,5.41666667 L11.9308317,5.41666667 C12.5213171,5.41666667 13,5.90169152 13,6.5 C13,7.09830848 12.5213171,7.58333333 11.9308317,7.58333333 L8.63450135,7.58333333 L7.63589819,9.31666667 L8.29565964,9.31666667 C8.53185377,9.31666667 8.72332694,9.51067661 8.72332694,9.75 C8.72332694,9.98932339 8.53185377,10.1833333 8.29565964,10.1833333 L7.13659662,10.1833333 L5.59317877,12.8656317 C5.55725264,12.9280353 5.49882018,12.9724157 5.43174295,12.9907056 L5.36229752,13 L4.57707145,13 L4.55610333,12.9978962 C4.51267695,12.9890959 4.48069792,12.9547924 4.47230803,12.9134397 L4.47223088,12.8704208 L5.51582215,7.58333333 L1.55989957,7.58333333 L0.891288881,8.55114605 C0.853775374,8.60544678 0.798421006,8.64327676 0.73629202,8.65879796 L0.672314689,8.66666667 L0.106844414,8.66666667 L0.0715243949,8.66058466 L0.0715243949,8.66058466 C0.0297243066,8.6457608 0.00275502199,8.60729104 0,8.5651586 L0.00593007386,8.52254537 L0.580855011,6.85813984 C0.64492547,6.67265611 0.6577034,6.47392717 0.619193545,6.28316421 L0.580694768,6.14191703 L0.00601851064,4.48064746 C0.00203480725,4.4691314 0,4.45701613 0,4.44481314 C0,4.39994001 0.0269259152,4.36143908 0.0652999725,4.34499318 L0.106916826,4.33647981 L0.672546853,4.33647981 C0.737865848,4.33647981 0.80011301,4.36066329 0.848265401,4.40322477 L0.89131128,4.45169723 L1.55989957,5.41666667 Z"
                                    ></path>
                                </svg>
                            </span>
                            <p className="text">تسجيل المالك</p>
                        </button>
                    </Link>
                </div>
                <div className="lg:hidden">
                    {!bar ? <FaBars onClick={() => setBar(true)} className="hover:text-[#2986FE] transition duration-400 cursor-pointer" size={30}/> :
                    <IoCloseSharp onClick={() => setBar(false)} className="hover:text-[#2986FE] transition duration-400 cursor-pointer" size={30}/> }
                </div>
            </div>
            <div className={`container mx-auto! lg:hidden transform : ${bar ? 'translate-x-0' : 'translate-x-[-450px]'} duration-400`}>
                <div className="flex flex-col items-center gap-4 bg-white border-2 border-[#2986FE] z-50 w-50 h-[90vh] p-5! left-0 fixed mt-3! rounded">
                    {links.map(link => (
                        <HashLink smooth className="text-center text-white bg-[#2986FE] border-2 border-[#2986FE] hover:text-[#2986FE] hover:bg-white p-2! w-full transition duration-300 rounded" key={link.id} to={link.to}>{link.name}</HashLink>
                    ))}
                    <Link to={"signin"}>
                        <button className="CartBtn bg-green-600">
                            <span className="IconContainer">
                                <svg viewBox="0 0 13 13" width="18px">
                                <path
                                    fill="white"
                                    d="M1.55989957,5.41666667 L5.51582215,5.41666667 L4.47015462,0.108333333 L4.47015462,0.108333333 C4.47015462,0.0634601974 4.49708054,0.0249592654 4.5354546,0.00851337035 L4.57707145,0 L5.36229752,0 C5.43359776,0 5.50087375,0.028779451 5.55026392,0.0782711996 L5.59317877,0.134368264 L7.13659662,2.81558333 L8.29565964,2.81666667 C8.53185377,2.81666667 8.72332694,3.01067661 8.72332694,3.25 C8.72332694,3.48932339 8.53185377,3.68333333 8.29565964,3.68333333 L7.63589819,3.68225 L8.63450135,5.41666667 L11.9308317,5.41666667 C12.5213171,5.41666667 13,5.90169152 13,6.5 C13,7.09830848 12.5213171,7.58333333 11.9308317,7.58333333 L8.63450135,7.58333333 L7.63589819,9.31666667 L8.29565964,9.31666667 C8.53185377,9.31666667 8.72332694,9.51067661 8.72332694,9.75 C8.72332694,9.98932339 8.53185377,10.1833333 8.29565964,10.1833333 L7.13659662,10.1833333 L5.59317877,12.8656317 C5.55725264,12.9280353 5.49882018,12.9724157 5.43174295,12.9907056 L5.36229752,13 L4.57707145,13 L4.55610333,12.9978962 C4.51267695,12.9890959 4.48069792,12.9547924 4.47230803,12.9134397 L4.47223088,12.8704208 L5.51582215,7.58333333 L1.55989957,7.58333333 L0.891288881,8.55114605 C0.853775374,8.60544678 0.798421006,8.64327676 0.73629202,8.65879796 L0.672314689,8.66666667 L0.106844414,8.66666667 L0.0715243949,8.66058466 L0.0715243949,8.66058466 C0.0297243066,8.6457608 0.00275502199,8.60729104 0,8.5651586 L0.00593007386,8.52254537 L0.580855011,6.85813984 C0.64492547,6.67265611 0.6577034,6.47392717 0.619193545,6.28316421 L0.580694768,6.14191703 L0.00601851064,4.48064746 C0.00203480725,4.4691314 0,4.45701613 0,4.44481314 C0,4.39994001 0.0269259152,4.36143908 0.0652999725,4.34499318 L0.106916826,4.33647981 L0.672546853,4.33647981 C0.737865848,4.33647981 0.80011301,4.36066329 0.848265401,4.40322477 L0.89131128,4.45169723 L1.55989957,5.41666667 Z"
                                ></path>
                                </svg>
                            </span>
                            <p className="text">تسجيل المالك</p>
                        </button>
                    </Link>
                </div>
            </div>
        </nav>
    )
}

export default Navbar