import { useEffect } from 'react';
import { Plane_Img } from '../../public/assets';
import { Swiper, SwiperSlide } from 'swiper/react';

// Import Swiper styles
import 'swiper/css';
import 'swiper/css/pagination';

import './Styles.css';

// import required modules
import { Mousewheel, Pagination, Autoplay } from 'swiper/modules';

import { FaWhatsapp } from "react-icons/fa";
import { Link } from 'react-router-dom';

import Aos from 'aos';
import 'aos/dist/aos.css';

const Panal = () => {
    useEffect(() => {
        Aos.init({ duration: 2500 });
    }, []);
    return (
        <header id='panal' className='scroll-mt-20'>
            <div className="container mx-auto!">
                <div className="panal_img grid grid-cols-1 md:grid-cols-2 items-center rounded-2xl overflow-hidden">
                <div data-aos="fade-left">
                    <Swiper
                        direction={'vertical'}
                        slidesPerView={1}
                        spaceBetween={30}
                        autoplay={{
                            delay: 3000,
                            disableOnInteraction: false,
                        }}
                        mousewheel={true}
                        loop={true}
                        pagination={{
                        clickable: true,
                        }}
                        modules={[Mousewheel, Pagination, Autoplay]}
                        className="mySwiper h-[250px]"
                    >
                        <SwiperSlide className='flex flex-col text-3xl lg:text-5xl gap-7 text-white font-semibold'>
                            <span>ارتقِ برحلة سفرك</span>
                            <h2>تجربة سحر الطيران <br/> من خلالنا ..!</h2>
                            <div className="flex gap-2 md:gap-5">
                                <Link to={"https://wa.me/201006677452?text= مرحبا , اريد الإستعلام عن تذاكر الطيران"} target='_blanck'>
                                    <button className="CartBtn text-[18px] bg-[#2986FE]">
                                        <span className="IconContainer">
                                            <svg viewBox="0 0 13 13" width="18px">
                                                <path
                                                    fill="white"
                                                    d="M1.55989957,5.41666667 L5.51582215,5.41666667 L4.47015462,0.108333333 L4.47015462,0.108333333 C4.47015462,0.0634601974 4.49708054,0.0249592654 4.5354546,0.00851337035 L4.57707145,0 L5.36229752,0 C5.43359776,0 5.50087375,0.028779451 5.55026392,0.0782711996 L5.59317877,0.134368264 L7.13659662,2.81558333 L8.29565964,2.81666667 C8.53185377,2.81666667 8.72332694,3.01067661 8.72332694,3.25 C8.72332694,3.48932339 8.53185377,3.68333333 8.29565964,3.68333333 L7.63589819,3.68225 L8.63450135,5.41666667 L11.9308317,5.41666667 C12.5213171,5.41666667 13,5.90169152 13,6.5 C13,7.09830848 12.5213171,7.58333333 11.9308317,7.58333333 L8.63450135,7.58333333 L7.63589819,9.31666667 L8.29565964,9.31666667 C8.53185377,9.31666667 8.72332694,9.51067661 8.72332694,9.75 C8.72332694,9.98932339 8.53185377,10.1833333 8.29565964,10.1833333 L7.13659662,10.1833333 L5.59317877,12.8656317 C5.55725264,12.9280353 5.49882018,12.9724157 5.43174295,12.9907056 L5.36229752,13 L4.57707145,13 L4.55610333,12.9978962 C4.51267695,12.9890959 4.48069792,12.9547924 4.47230803,12.9134397 L4.47223088,12.8704208 L5.51582215,7.58333333 L1.55989957,7.58333333 L0.891288881,8.55114605 C0.853775374,8.60544678 0.798421006,8.64327676 0.73629202,8.65879796 L0.672314689,8.66666667 L0.106844414,8.66666667 L0.0715243949,8.66058466 L0.0715243949,8.66058466 C0.0297243066,8.6457608 0.00275502199,8.60729104 0,8.5651586 L0.00593007386,8.52254537 L0.580855011,6.85813984 C0.64492547,6.67265611 0.6577034,6.47392717 0.619193545,6.28316421 L0.580694768,6.14191703 L0.00601851064,4.48064746 C0.00203480725,4.4691314 0,4.45701613 0,4.44481314 C0,4.39994001 0.0269259152,4.36143908 0.0652999725,4.34499318 L0.106916826,4.33647981 L0.672546853,4.33647981 C0.737865848,4.33647981 0.80011301,4.36066329 0.848265401,4.40322477 L0.89131128,4.45169723 L1.55989957,5.41666667 Z"
                                                ></path>
                                            </svg>
                                        </span>
                                        <p className="text">إحجز الان</p>
                                    </button>
                                </Link>
                                <Link to={"https://wa.me/201006677452?text= السلام عليكم ورحمة الله و بركاته"} target='_blanck'>
                                    <button className="CartBtn text-[18px] bg-green-600">
                                        <span className="IconContainer">
                                            <FaWhatsapp/>
                                        </span>
                                        <p className="text">تواصل معنا</p>
                                    </button>
                                </Link>
                            </div>
                        </SwiperSlide>
                        <SwiperSlide className='flex flex-col text-3xl lg:text-5xl gap-7 text-white font-semibold'>
                            <span>ارتقِ بزيارتك معانا</span>
                            <h2>تجربة زيارتك الاولى<br/> من خلالنا ..!</h2>
                            <div className="flex gap-2 md:gap-5">
                                <Link to={"https://wa.me/201006677452?text= مرحبا , اريد الإستعلام عن الزيارات المتاحه"} target='_blanck'>
                                    <button className="CartBtn text-[18px] bg-[#2986FE]">
                                        <span className="IconContainer">
                                            <svg viewBox="0 0 13 13" width="18px">
                                                <path
                                                    fill="white"
                                                    d="M1.55989957,5.41666667 L5.51582215,5.41666667 L4.47015462,0.108333333 L4.47015462,0.108333333 C4.47015462,0.0634601974 4.49708054,0.0249592654 4.5354546,0.00851337035 L4.57707145,0 L5.36229752,0 C5.43359776,0 5.50087375,0.028779451 5.55026392,0.0782711996 L5.59317877,0.134368264 L7.13659662,2.81558333 L8.29565964,2.81666667 C8.53185377,2.81666667 8.72332694,3.01067661 8.72332694,3.25 C8.72332694,3.48932339 8.53185377,3.68333333 8.29565964,3.68333333 L7.63589819,3.68225 L8.63450135,5.41666667 L11.9308317,5.41666667 C12.5213171,5.41666667 13,5.90169152 13,6.5 C13,7.09830848 12.5213171,7.58333333 11.9308317,7.58333333 L8.63450135,7.58333333 L7.63589819,9.31666667 L8.29565964,9.31666667 C8.53185377,9.31666667 8.72332694,9.51067661 8.72332694,9.75 C8.72332694,9.98932339 8.53185377,10.1833333 8.29565964,10.1833333 L7.13659662,10.1833333 L5.59317877,12.8656317 C5.55725264,12.9280353 5.49882018,12.9724157 5.43174295,12.9907056 L5.36229752,13 L4.57707145,13 L4.55610333,12.9978962 C4.51267695,12.9890959 4.48069792,12.9547924 4.47230803,12.9134397 L4.47223088,12.8704208 L5.51582215,7.58333333 L1.55989957,7.58333333 L0.891288881,8.55114605 C0.853775374,8.60544678 0.798421006,8.64327676 0.73629202,8.65879796 L0.672314689,8.66666667 L0.106844414,8.66666667 L0.0715243949,8.66058466 L0.0715243949,8.66058466 C0.0297243066,8.6457608 0.00275502199,8.60729104 0,8.5651586 L0.00593007386,8.52254537 L0.580855011,6.85813984 C0.64492547,6.67265611 0.6577034,6.47392717 0.619193545,6.28316421 L0.580694768,6.14191703 L0.00601851064,4.48064746 C0.00203480725,4.4691314 0,4.45701613 0,4.44481314 C0,4.39994001 0.0269259152,4.36143908 0.0652999725,4.34499318 L0.106916826,4.33647981 L0.672546853,4.33647981 C0.737865848,4.33647981 0.80011301,4.36066329 0.848265401,4.40322477 L0.89131128,4.45169723 L1.55989957,5.41666667 Z"
                                                ></path>
                                            </svg>
                                        </span>
                                        <p className="text">إستفسر الان</p>
                                    </button>
                                </Link>
                                <Link to={"https://wa.me/201006677452?text= السلام عليكم ورحمة الله و بركاته"} target='_blanck'>
                                    <button className="CartBtn text-[18px] bg-green-600">
                                        <span className="IconContainer">
                                            <FaWhatsapp/>
                                        </span>
                                        <p className="text">تواصل معنا</p>
                                    </button>
                                </Link>
                            </div>
                        </SwiperSlide>
                        <SwiperSlide className='flex flex-col text-3xl lg:text-5xl gap-7 text-white font-semibold'>
                            <span>ارتقِ بإقامتك معانا</span>
                            <h2>تجربة إقامتك المميزه <br/> من خلالنا ..!</h2>
                            <div className="flex gap-2 md:gap-5">
                                <Link to={"https://wa.me/201006677452?text= مرحبا , اريد الإستعلام عن الفيز المتاحه"} target='_blanck'>
                                    <button className="CartBtn text-[18px] bg-[#2986FE]">
                                        <span className="IconContainer">
                                            <svg viewBox="0 0 13 13" width="18px">
                                                <path
                                                    fill="white"
                                                    d="M1.55989957,5.41666667 L5.51582215,5.41666667 L4.47015462,0.108333333 L4.47015462,0.108333333 C4.47015462,0.0634601974 4.49708054,0.0249592654 4.5354546,0.00851337035 L4.57707145,0 L5.36229752,0 C5.43359776,0 5.50087375,0.028779451 5.55026392,0.0782711996 L5.59317877,0.134368264 L7.13659662,2.81558333 L8.29565964,2.81666667 C8.53185377,2.81666667 8.72332694,3.01067661 8.72332694,3.25 C8.72332694,3.48932339 8.53185377,3.68333333 8.29565964,3.68333333 L7.63589819,3.68225 L8.63450135,5.41666667 L11.9308317,5.41666667 C12.5213171,5.41666667 13,5.90169152 13,6.5 C13,7.09830848 12.5213171,7.58333333 11.9308317,7.58333333 L8.63450135,7.58333333 L7.63589819,9.31666667 L8.29565964,9.31666667 C8.53185377,9.31666667 8.72332694,9.51067661 8.72332694,9.75 C8.72332694,9.98932339 8.53185377,10.1833333 8.29565964,10.1833333 L7.13659662,10.1833333 L5.59317877,12.8656317 C5.55725264,12.9280353 5.49882018,12.9724157 5.43174295,12.9907056 L5.36229752,13 L4.57707145,13 L4.55610333,12.9978962 C4.51267695,12.9890959 4.48069792,12.9547924 4.47230803,12.9134397 L4.47223088,12.8704208 L5.51582215,7.58333333 L1.55989957,7.58333333 L0.891288881,8.55114605 C0.853775374,8.60544678 0.798421006,8.64327676 0.73629202,8.65879796 L0.672314689,8.66666667 L0.106844414,8.66666667 L0.0715243949,8.66058466 L0.0715243949,8.66058466 C0.0297243066,8.6457608 0.00275502199,8.60729104 0,8.5651586 L0.00593007386,8.52254537 L0.580855011,6.85813984 C0.64492547,6.67265611 0.6577034,6.47392717 0.619193545,6.28316421 L0.580694768,6.14191703 L0.00601851064,4.48064746 C0.00203480725,4.4691314 0,4.45701613 0,4.44481314 C0,4.39994001 0.0269259152,4.36143908 0.0652999725,4.34499318 L0.106916826,4.33647981 L0.672546853,4.33647981 C0.737865848,4.33647981 0.80011301,4.36066329 0.848265401,4.40322477 L0.89131128,4.45169723 L1.55989957,5.41666667 Z"
                                                ></path>
                                            </svg>
                                        </span>
                                        <p className="text">إستفسر الان</p>
                                    </button>
                                </Link>
                                <Link to={"https://wa.me/201006677452?text= السلام عليكم ورحمة الله و بركاته"} target='_blanck'>
                                    <button className="CartBtn text-[18px] bg-green-600">
                                        <span className="IconContainer">
                                            <FaWhatsapp/>
                                        </span>
                                        <p className="text">تواصل معنا</p>
                                    </button>
                                </Link>
                            </div>
                        </SwiperSlide>
                    </Swiper>
                </div>
                    <div data-aos="fade-right">
                        <img style={{transform: "scaleX(-1)"}} src={Plane_Img} alt="Image-Error" loading='lazy' />
                    </div>
                </div>
            </div>
        </header>
    )
}

export default Panal